Autodesk.Navisworks.Api.Rotation3D
A rotation in 3D space defined as a quaternion.

Autodesk.Navisworks.Api.Rotation3D.#ctor
Default constructor, makes an Identity rotation
Throws System.InvalidOperationException:
Exception when 'false'

Autodesk.Navisworks.Api.Rotation3D.#ctor(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Creates rotation that rotates vector1 to same direction as vector2
Throws System.ArgumentNullException:
Argument 'vector1' is null
Throws System.ArgumentException:
Argument 'vector1' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector2' is null
Throws System.ArgumentException:
Argument 'vector2' has been Disposed

Autodesk.Navisworks.Api.Rotation3D.#ctor(Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D,Autodesk.Navisworks.Api.UnitVector3D)
Creates rotation about axis by angle between v1 and v2 projected onto plane normal to axis.
Throws System.ArgumentNullException:
Argument 'axis' is null
Throws System.ArgumentException:
Argument 'axis' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector1' is null
Throws System.ArgumentException:
Argument 'vector1' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector2' is null
Throws System.ArgumentException:
Argument 'vector2' has been Disposed

Autodesk.Navisworks.Api.Rotation3D.#ctor(Autodesk.Navisworks.Api.UnitVector3D,System.Double)
Creates rotation about given axis by angle in radians
Throws System.ArgumentNullException:
Argument 'axis' is null
Throws System.ArgumentException:
Argument 'axis' has been Disposed

Autodesk.Navisworks.Api.Rotation3D.#ctor(System.Double,System.Double,System.Double,System.Double)
Creates rotation from 4 components

Autodesk.Navisworks.Api.Rotation3D.A
The 'A' component of the quaternion
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.B
The 'B' component of the quaternion
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.C
The 'C' component of the quaternion
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.CreateFromEulerAngles(System.Double,System.Double,System.Double)
Creates a Euler angle rotation.
Parameters are in radians.
Rotation is created by combination of rotations about X, Y and Z axes.

Autodesk.Navisworks.Api.Rotation3D.D
The 'D' component of the quaternion
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Rotation3D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Rotation3D.Identity
Creates an Identity rotation

Autodesk.Navisworks.Api.Rotation3D.Invert
Returns an inverted version of this rotation (all components inverted)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.IsIdentity
Determines if the Rotation is an identity
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Rotation3D.Item(System.Int32)


Autodesk.Navisworks.Api.Rotation3D.Normalize
Returns a normalized version of this rotation (magnitude of 1)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Rotation3D.ToAxisAndAngle
Calculates an axis and angle representation of this rotation.

Autodesk.Navisworks.Api.Rotation3D.ToEulerAngles
Calculates the Euler angles for this rotation.

Autodesk.Navisworks.Api.Rotation3D.TolerantEquals(Autodesk.Navisworks.Api.Rotation3D)
Equal within a tolerance, treating quaternion as 4D position. Equality of representation, not of rotation.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.Rotation3D.TolerantEquals(Autodesk.Navisworks.Api.Rotation3D,System.Double)
Equal within a tolerance, treating quaternion as 4D position. Equality of representation, not of rotation.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'rotation' is null
Throws System.ArgumentException:
Argument 'rotation' has been Disposed

Autodesk.Navisworks.Api.Rotation3D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .